export const template = {
    list: {
        entities: {
            '/events': ['אירועים'],
            '/events?type=deposit': ['הפקדות', 'אירועי הפקדה'],
            '/events?type=withdrawal': ['משיכות', 'אירועי משיכה'],
            '/events?type=opened': ['אירועים פתוחים', 'משיכות פתוחות'],
            '/events?type=closed': ['אירועים סגורים', 'משיכות סגורות'],
            '/events?type=archive': ['אירועים בארכיון', 'הפקדות בארכיון', 'משיכות בארכיון'],
            '/desks': ['קופות'],
            '/desks?type=archive': ['קופות בארכיון'],
            '/workers': ['עובדים'],
            '/workers?type=archive': ['עובדים בארכיון']
        },
        filter: {
            'worker=$id': ['לפי עובד מספר', 'עובד מספר', 'של עובד מספר'],
            'worker=$name': ['לפי עובד בשם', 'עובד בשם', 'של עובד בשם'],
            'desk=$id': ['לפי קופה מספר', 'קופה מספר', 'של קופה מספר'],
            'desk=$name': ['לפי קופה בשם', 'קופה בשם', 'של קופה בשם']
        }
    },
    card: {
        '/workerCard?id=$id': ['עובד מספר','כרטיס עובד מספר','כרטיס עובד'],
        '/workerCard?id=$name': ['עובד בשם','עובד לפי שם','כרטיס עובד בשם','כרטיס עובד לפי שם','כרטיס עובד'],
        '/deskCard?id=$id': ['קופה מספר','כרטיס קופה מספר','כרטיס קופה','כרטיס קופת'],
        '/deskCard?id=$name': ['קופה בשם','כרטיס קופה בשם','כרטיס קופה','כרטיס קופת']
    },
    newCard: {
        '/eventCard?id=0&isDep=1': ['אירוע חדש', 'אירוע חדש הפקדה', 'הפקדה חדשה'],
        '/eventCard?id=0&isDep=0': ['אירוע חדש משיכה', 'משיכה חדשה'],
        '/workerCard?id=0': ['עובד חדש'],
        '/deskCard?id=0': ['קופה חדשה']
    },
    report: {
        '/reports/report?type=0': ['כרטסת קופה', 'כרטסת קופה בשם'],
        '/reports/report?type=1': ['מאזן תנועות בקופות','מאזן תנועות']
    },
    repForPeriod: [
        '',
        'עבור',
        'בתקופה',
        'לתקופה'
    ], 
    repPeriod: {
        'month':['חודש','חודש נוכחי','מתחילת החודש'],
        'quarter': ['רבעון','רבעון נוכחי','מתחילת רבעון'],
        'year': ['שנה','שנה נוכחית','מתחילת השנה'],
        'all': ['כל התקופות','כל התאריכים','כל הזמן']
    },
    remove: [
        'להראות',
        'תראה',
        'תראה לי',
        'להציג',
        'הצגה',
        'הצגת',
        'תציג לי',
        'פתח',
        'תפתח',
        'פתח לי',
        'תפתח לי',
        'פתיחה',
        'פתיחת',
        'של',
        'יצירה',
        'יצירת',
        'את',
        'כל',
        'הכל',
        'תמצא לי',
        'למצוא',
        'חפש',
        'תחפש',
        'תחפש לי',        
        'טבלה',
        'טבלת',
        'הטבלה',
        'רשימה',
        'הרשימה',
        'רשימה של'       
    ]
}